{"config": {"layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 32, 32, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"trainable": true, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "bias_constraint": null, "filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "bias_constraint": null, "filters": 32, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "bias_constraint": null, "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_4", "kernel_constraint": null, "bias_constraint": null, "filters": 64, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "same"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.25}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 512, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.5}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 4, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_2"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.5"}