{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.5", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "name": "input_1", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_1", "padding": "same", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_2", "padding": "same", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_3", "padding": "same", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_constraint": null, "activation": "relu", "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "dilation_rate": [1, 1], "name": "conv2d_4", "padding": "same", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "bias_constraint": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"rate": 0.25, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"activation": "relu", "trainable": true, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "units": 512}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"activation": "softmax", "trainable": true, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "units": 4}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]]}}